#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
random_integer.name_suffix: Refreshing state... [id=23156]
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/4d8e572a-3214-40e9-a26f-8f71ecd24e0d/resourceGroups/adolabs-23156]
azurerm_virtual_network.main: Refreshing state... [id=/subscriptions/4d8e572a-3214-40e9-a26f-8f71ecd24e0d/resourceGroups/adolabs-23156/providers/Microsoft.Network/virtualNetworks/adolabs-23156]
azurerm_subnet.main["subnet1"]: Refreshing state... [id=/subscriptions/4d8e572a-3214-40e9-a26f-8f71ecd24e0d/resourceGroups/adolabs-23156/providers/Microsoft.Network/virtualNetworks/adolabs-23156/subnets/subnet1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_subnet.main["subnet2"] will be created
  + resource "azurerm_subnet" "main" {
      + address_prefixes                               = [
          + "10.42.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "subnet2"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "adolabs-23156"
      + virtual_network_name                           = "adolabs-23156"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @ned1313, Action: `pull_request`, Working Directory: ``, Workflow: `Pull Request Main`*